driver-tests/bpelse/assign/AssignJbi/test/CopydurationInvoke/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns:tns="http://sun.com/echo/"
                   xmlns="urn:DataType">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
   <durationPart>
	<xsd_duration>P2005Y8M25DT16H0M0S</xsd_duration>
        <optional_duration>P2006Y2M27DT23H10M0S</optional_duration>
	<repeat_duration>P2006Y2M27DT23H10M0S</repeat_duration>
	<repeat_duration>P2006Y10M25DT2H23M59S</repeat_duration>
   </durationPart>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
